patterns:
    $aux = (конечно*|конешн*|канешн*|несомнен*|безусловно*|разумеетс*|наверн*|естественно*|естествено*|точно*|вроде [бы]|вродебы|как бы|какбы)
    $conditions = (~тепло|~жара|жарко|~холод|холодно|мороз*|непогод*|~метель|~дождь)
    $hello = (привет*|ghbdtn|привеет|поивет*|приивеет|приветик|приветики|при вед|дратути|здравствуй*|зраствуйте|здрасьте|хэй|хай|хей|хэллоу|халоу|здаров|шалом|hello|приыет|hallo|здарова|здарово*|здвраво*|хелло*|здаровеньки|здоровеньки|здрасте|салют|hi|приветствую|добро* времен* суток|хеллоу|п р и в е т|здраствуй*|здорова|здорово|здрасти|здрсте|здрсти|задраивай*|здравствуете|алоха|дарова|дорова|дороу|bonjour|бонжур*|бомжур*|бонджур*|бонжор*|банжор*|салам|драсте|хело*|хелло*{(утр*|день*|вечер*|ночи*|дня*) [добр*]}|{здрав* жела*})
    $yes = {[$aux] (да|даа|дааа*|конечно*|конешн*|канешн*|+|ага|угу|давай|ок*|ok*|yes|окей|оки|оу-кей|o'k|океюшки|if|fuf|хочу|хотим|хоч*|o k|о к|о'кей|лан|ладн*|несомнен*|безусловно*|разумеетс*|естественно*|естествено*|точно*)}
    $no = {[$aux] (не (хоч*|хотим|соглас*|буд*|точно*)|отказ*|откаж*|несоглас*|не|ни|нет|нетушк*|неа|не-а|no|not|неточно*)}
    $weather = (погод*|метеоуслови*|метео услови*|погодн* услови*|метеообстановк*|метео обстановк*|распогод*)
